tutorials/incompressible/wDissipationTempResidenceTauSimpleFoam/2019_07_30_dedicatedSolverW_simple_pipe/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 473.15;
//existing boundaries (ignore everything else and set defaultfaces to empty) ['', '    outlet\n', '    defaultName\n', '    inlet\n']
boundaryField
{


    inlet
    {
        type            fixedValue;			
        value           uniform 473.15;			
    }

    defaultName
    {
        type            fixedValue;
        value           uniform 473.15;
	// fixe Temperatur von 513 K = 240 °C
    }

    wall
    {
        type            fixedValue;
        value           uniform 473.15;
	// fixe Temperatur von 513 K = 240 °C
    }
    outlet
    {
        type            zeroGradient;
	// wird berechnet
    }
}

// ************************************************************************* //
