tutorials/incompressible/wDissipationTempResidenceTauSimpleFoam/2019_07_30_dedicatedSolverW_simple_pipe/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  GermanCarreau;
//transportModel BirdCarreau ; 
//transportModel Newtonian;
nu nu	[ 0 2 -1 0 0 0 0 ] 10 ; 

BirdCarreauCoeffs
{
nu0 nu0 	[ 0 2 -1 0 0 0 0 ] 17.897 ; 
nuInf nuInf 	[ 0 2 -1 0 0 0 0 ] 1e-12 ;
k k 		[0 0 1 0 0 0 0] 1.059;
n n 		[0 0 0 0 0 0 0] 0.376; 
}
// 		    nu0 is viscosity at zero shear rate
//		    nuInf is viscosity at infinite shear rate
// 		    m determines where the slope starts, you can find the start at a shear rate of (1/m) [1/s]
// 		    n shows how steep the slope is: n=0.1 is a very gentle slope, n=3 means you lose 3 decades of nu in one decade of shear rate

//Hostalen GD 9550
GermanCarreauCoeffs
{
    nuA             nuA [0 2 -1 0 0 0 0] 12.87;
    B               B [0 0 1 0 0 0 0] 0.1871;
    C               C [0 0 0 0 0 0 0] 0.655;
    Ts              Ts [0 0 0 0 0 0 0] 237;
    Tmeasure        Tmeasure [0 0 0 0 0 0 0] 473;
}
// 		    nuA is the kinematic viscosity at zero shear rate (nu = eta/rho or mu/rho)
// 		    B determines where the slope starts, you can find the start at a shear rate of (1/B) [1/s]
// 		    C shows how steep the slope is: C=0.1 is a very gentle slope, C=3 means you lose 3 decades of nu in one decade of shear rate
//		    Ts is the standard temperature. Typically "Einfriertemperatur" +50 K. Some values: 
//		         (PE-HD 153 Kelvin) (PE-LD 233 Kelvin) (PP 263 Kelvin) (PA6 313 Kelvin) (PS 373 Kelvin) (PVC 353 Kelvin) (PC 413 Kelvin)
//		    Tmeasure is the temperature in KELVIN at which the parameters nuA, B, C were measured


DT		DT  [0 2 -1 0 0 0 0] 3e-7;
c		c   [0 2 -2 -1 0 0 0] 1900;
//		DT is the thermal diffusivity (german literature alpha_t). is defined as: (thermal conductivity kappa or lambda) / (density*c)
//		c is the heat capacity.

Dconcentration	Dconcentration  [0 2 -1 0 0 0 0] 3e-7;

rhoFluid		rhoFluid [1 -3 0 0 0 0 0] 736;
//rho is density in kg/m³

meltPressurePrefixScalar meltPressurePrefixScalar  [0 0 0 0 0 0 0] 01;

materialsToAlpha  materialsToAlpha  [0 0 -1 0 0 0 0] 1e9;
//higher values: more flow resistance.

// ************************************************************************* //
